muse/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "hometown", "img", "albums", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "vbnm"], ["hometown", "ghjk"], ["img", "ghjkl"], ["albums", 0], ["created_at", "2020-04-01 16:24:40.969954"], ["updated_at", "2020-04-01 16:24:40.969954"]]
---
      def create
        Artist.create(params.require(:artist).permit(:name, :albums, :hometown, :img))

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
      def update
        artist = Artist.find(params[:id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 5]]
---
      def destroy
        Artist.find(params[:id]).destroy

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def find_Artist
  @artist = Artist.find(params[:id])