muse/app/controllers/songs_controller.rb

    def new
      @artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        puts params
        artist = Artist.find(params[:song][:artist_id])
        Song.create(params.require(:song).permit(:title, :length, :genre, :artist_id))
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "songs" ("artist_id", "title", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist_id", 1], ["title", "fghj"], ["genre", "ghj"], ["created_at", "2020-03-30 19:27:02.918279"], ["updated_at", "2020-03-30 19:27:02.918279"]]